<!DOCTYPE html>
<html>

  <head>
    <meta charset="utf-8" />
    <title>Alpha EdTech</title>
  </head>

  <body>
    <p>
      Em um software editor de texto para editar documentos, livros, jornais e etc. &eacute; poss&iacute;vel usar o teclado e as op&ccedil;&otilde;es
      do menu que o pr&oacute;prio software oferece para editar qualquer tipo de texto e imagens com toda a sorte de formata&ccedil;&otilde;es
      poss&iacute;veis, por exemplo: In Design, Microsoft Word, FocusWriter, entre outros.
    </p>
    <p>
      Para escrever publia&ccedil;&otilde;es em sites, no entanto, &eacute; necess&aacute;rio escrever e editar p&aacute;ginas usando a linguagem suportada
      pelos navegadores de internet. Essa linguagem &eacute; chamada de HTML - HyperText Markup Language. Os hipertextos s&atilde;o conjuntos
      de elementos conectados. Esses elementos podem ser palavras, imagens, v&iacute;deos, documentos, etc.
    </p>
    <p>
      Em qualquer p&aacute;gina na internet &eacute; poss&iacute;vel observar diferentes distribui&ccedil;&otilde;es e tamanhos para t&iacute;tulos, par&aacute;grafos, imagens
      e qualquer outro elemento. Essa formata&ccedil;&atilde;o &eacute; estabelecida atrav&eacute;s do HTML, o qual &eacute; estruturado em conjuntos de tags,
      que s&atilde;o blocos de constru&ccedil;&atilde;o das p&aacute;ginas respons&aacute;veis pela hierarquiza&ccedil;&atilde;o, marca&ccedil;&atilde;o e estrutura dos conte&uacute;dos, dividindo
      entre se&ccedil;&otilde;es, par&aacute;grafos, cabe&ccedil;alhos, entre outros. A prop&oacute;sito, este texto &eacute; um par&aacute;grafo e foram utilizadas as tags
      &lt;p&gt; e &lt;/p&gt; para configur&aacute;-lo desta forma.
    </p>
    <p>
      Nesta publica&ccedil;&atilde;o, iremos demonstrar o uso das tags b&aacute;sicas em uma p&aacute;gina estruturada em HTML.
    </p>
    <hr />
    <p>As tags de abertura e fechamento &lt;html&gt; e &lt;/html&gt; possibilitam que as informa&ccedil;&otilde;es sejam lidas nos browsers 
      e englobam tudo o que &eacute; renderizado nas p&aacute;ginas da internet.</p>
    <p>As tags &lt;head&gt; e &lt;/head&gt; recebem informa&ccedil;&otilde;es b&aacute;sicas da p&aacute;gina como o t&iacute;tulo da p&aacute;gina, links externos e metadados.</p>
    <p>A tag &lt;meta charset=&quot;utf-8&quot;/&gt; indica o formato de codifica&ccedil;&atilde;o definido pelos caracteres que ser&atilde;o usados em uma 
      determinada p&aacute;gina. Nesta p&aacute;gina o codifica&ccedil;&atilde;o de caractere usada &eacute; o UTF-8.</p>
    <P>As tags &lt;title&gt; e &lt;/title&gt; servem para definir o t&iacute;tulo da p&aacute;gina. Nesse exemplo o t&iacute;tulo da p&aacute;gina &eacute; Alpha 
      Edtech, e est&aacute; exibido na aba da p&aacute;gina na barra superior do browser.</P>
    <p>As tags &lt;body&gt; e &lt;/body&gt; comportam todas as informa&ccedil;&otilde;es que far&atilde;o parte do corpo da p&aacute;gina. Inclusive este
      conte&uacute;do que voc&ecirc; est&aacute; lendo agora.</p>
      <h1 style="color: #004724; font-family: 'Courier New'">alpha em &quot;h1&quot;</h1>
      <h2 style="color: rgb(35, 186, 136); font-family: 'Courier New'">&lt;ed/tech&gt; em &quot;h2&quot;</h2>
      <h3 style="font-family: 'Courier New'">Trilha: Front-end - HTML em &quot;h3&quot;</h3>
      <h4 style="font-family: 'Courier New'">Aula: Linguagem de nota&ccedil;&atilde;o HTML - parte 1 em &quot;h4&quot;</h4>
      <p>A tag &lt;br/&gt; ocasiona uma quebra de linha como esta quebra na palavra quebrado: que-<br/>brado.</p>
      <p>As tags &lt;sup&gt; e &lt;/sup&gt; configuram um texto sobrescrito, por exemplo: texto comum<sup>texto sobrescrito</sup>.</p>
      <p>As tags &lt;sub&gt; e &lt;/sub&gt; configuram um texto subescrito, por exemplo: texto comum<sub>texto subescrito</sub>.</p>
      <a href="index.html">Texto azul marinho, sublinhado e muda o ponteiro do mouse quanto est&aacute; sobre ele? Isto &eacute; um link para outra p&aacute;gina na internet. Para onde ser&aacute; que ele vai te levar??</a>
      <br />
      <br />
      <a href="https://medium.com/stonepagamentos/uma-nova-realidade-9b462f7a5fcc">
        <img style="height: 400px; width: 700px; border-radius: 5%;" src="https://miro.medium.com/max/1400/1*fiio8UG8pcCax5kWj-QmKw.png" alt="Instituto Alpha Lumen - Nuricel Aguillera">
      </a>
      <br>
      <hr />
      <br>
    
    <p>Parab&eacute;ns por ter chegado at&eacute; aqui! Nesse post voc&ecirc; aprendeu sobre o HTML e suas principais tags, que s&atilde;o elas:</p>
    <ul>
        <li>&lt;html&gt; e &lt;/html&gt;</li>
        <li>&lt;head&gt; e &lt;/head&gt;</li>
        <li>&lt;meta /&gt;</li>
        <li>&lt;title&gt; e &lt;/title&gt;</li>
        <li>&lt;body&gt; e &lt;/body&gt;</li>
        <li>&lt;h1&gt; e &lt;/h1&gt;</li>
        <li>&lt;h2&gt; e &lt;/h2&gt;</li>
        <li>&lt;h3&gt; e &lt;/h3&gt;</li>
        <li>&lt;h4&gt; e &lt;/h4&gt;</li>
        <li>&lt;p&gt; e &lt;/p&gt;</li>
        <li>&lt;a&gt; e &lt;/a&gt;</li>
        <li>&lt;img /&gt;</li>
        <li>&lt;br /&gt;</li>
        <li>&lt;ul&gt; e &lt;/ul&gt;</li>
        <li>&lt;li&gt; e &lt;/li&gt;</li>
    </ul>
    <br>
    <br>
    <div>
      <img style="height: 110px; width: 100px; border-radius: 3%;" src="https://edtech-uploads.s3.amazonaws.com/uploads/photos/sTRBr1229202112374361cc80c7aadf0.png" alt="scytar">
    </div>
    <span> Autor: Marlisson Lopes da Silva </span>
    
  </body>

</html>
